БПКР/src/Documents/ЭТТНИсходящая/ЭТТНИсходящая.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЭТТНИсходящая</name>
  <basedOn>Document.РеализацияТоваровУслуг</basedOn>
  <basedOn>Document.ВозвратТоваровОтПокупателя</basedOn>
  <basedOn>Document.ПеремещениеТоваров</basedOn>
  <basedOn>Document.СписаниеТоваров</basedOn>
  <basedOn>Document.ОприходованиеТоваров</basedOn>
  <basedOn>Document.ПоступлениеТоваровУслуг</basedOn>
  <basedOn>Document.ОтчетПроизводстваЗаСмену</basedOn>
  <posting>Deny</posting>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийТТН</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СкладПолучатель</name>
    <type>
      <types>CatalogRef.СкладыКонтрагентов</types>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Грузоотправитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Грузополучатель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автомобиль</name>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерАТС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПутевогоЛиста</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.Водители</types>
    </type>
  </attributes>
  <attributes>
    <name>МассаГрузаНетто</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МассаГрузаБрутто</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоверенностьНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоверенностьДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоверенностьВыдана</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоверенностьЧерезКого</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
      <types>DocumentRef.СписаниеТоваров</types>
      <types>DocumentRef.ВозвратТоваровОтПокупателя</types>
      <types>DocumentRef.ПеремещениеТоваров</types>
      <types>DocumentRef.ОтчетПроизводстваЗаСмену</types>
      <types>DocumentRef.ВозвратТоваровПоставщику</types>
      <types>DocumentRef.ОприходованиеТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЭСФ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособПеревозки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Перевозчик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИННПеревозчика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПрицепа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаСписания</name>
    <type>
      <types>CatalogRef.ПричиныСписания</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОприходования</name>
    <type>
      <types>CatalogRef.ПричиныОприходования</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПоставки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерПрейскуранта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВесЕдиницыНоменклатуры</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидУпаковки</name>
      <type>
        <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>ВесУпаковки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоМест</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МассаГрузаНетто</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>МассаГрузаБрутто</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>КодыМаркировки</name>
    <attributes>
      <name>КодМаркировки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

БПКР/src/Enums/ПризнакиСтраны/ПризнакиСтраны.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПризнакиСтраны</name>
  <enumValues>
    <name>КР</name>
  </enumValues>
  <enumValues>
    <name>ЕАЭС</name>
    <comment>Страны Евразийского экономического союза</comment>
  </enumValues>
  <enumValues>
    <name>ИмпортЭкспорт</name>
    <comment>Страны за пределами Евразийского экономического союза</comment>
  </enumValues>
</mdclass:Enum>

БПКР/src/Enums/ВидыОперацийТТН/ВидыОперацийТТН.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийТТН</name>
  <enumValues>
    <name>Реализация</name>
  </enumValues>
  <enumValues>
    <name>Перемещение</name>
  </enumValues>
  <enumValues>
    <name>Списание</name>
  </enumValues>
  <enumValues>
    <name>Оприходование</name>
  </enumValues>
  <enumValues>
    <name>Возврат</name>
  </enumValues>
  <enumValues>
    <name>ВыгрузкаОстатков</name>
  </enumValues>
</mdclass:Enum>

БПКР/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ГотоваяПродукция</name>
      <description>Готовая продукция</description>
    </items>
    <items>
      <name>Материалы</name>
      <description>Материалы</description>
    </items>
    <items>
      <name>МБП</name>
      <description>МБП</description>
    </items>
    <items>
      <name>Полуфабрикаты</name>
      <description>Полуфабрикаты</description>
    </items>
    <items>
      <name>Товары</name>
      <description>Товары</description>
    </items>
    <items>
      <name>Услуги</name>
      <description>Услуги</description>
    </items>
  </predefined>
  <attributes>
    <name>Артикул</name>
    <comment>Код производителя</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.КлассификаторЕдиницИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Услуга</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатурнаяГруппа</name>
    <type>
      <types>CatalogRef.НоменклатурныеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНСП</name>
    <type>
      <types>CatalogRef.СтавкиНСП</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеСтавкиНСП</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтранаПроисхождения</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяСпецификацияНоменклатуры</name>
    <type>
      <types>CatalogRef.СпецификацииНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>КодТНВЭД</name>
    <type>
      <types>CatalogRef.КлассификаторТНВЭД</types>
    </type>
  </attributes>
  <attributes>
    <name>КодГКЭД</name>
    <type>
      <types>CatalogRef.КлассификаторГКЭД</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлКартинки</name>
    <type>
      <types>CatalogRef.НоменклатураПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторНоменклатурыЭСФ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоМаркированнаяПродукция</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

БПКР/src/Documents/ЭТТНИсходящая/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ЗаполненияДокумента

// Процедура заполнения документа на основании.
//
// Параметры:
//	ДанныеЗаполнения - ДокументСсылка.РеализацияТоваровУслуг - Данные заполнения документа.
//	
Процедура ЗаполнитьПоРеализацииТоваровУслуг(ДанныеЗаполнения) Экспорт
	
	ДокументОснование = ДанныеЗаполнения;
	
	Организация = ДанныеЗаполнения.Организация;
	Контрагент = ДанныеЗаполнения.Контрагент;
	
	Если Контрагент.ПризнакСтраны = Перечисления.ПризнакиСтраны.КР Тогда
		ВидПоставки = 10;	
	Иначе
		ВидПоставки = 20;	
	КонецЕсли;	
	
	ЗаполнитьДанныеГрузополучателя();
	
	Если БухгалтерскийУчетВызовСервераПовтИсп.ВедетсяУчетЭСФ() Тогда 
		СведенияОбЭСФ = ЭСФСервер.СведенияОбЭСФПоДокументуОснованию(Организация, ДокументОснование);
		
		Если ТипЗнч(СведенияОбЭСФ.ПредставлениеЭСФ) = Тип("ДокументСсылка.ЭлектронныйСчетФактураВыписанный") Тогда
			НомерЭСФ = СведенияОбЭСФ.ПредставлениеЭСФ.НомерЭСФ;
		КонецЕсли;	
	КонецЕсли;
	
	Товары.Очистить();  
	
	КлючСвязи = 1;
	
	Для Каждого СтрокаТабличнойЧасти Из ДанныеЗаполнения.Товары Цикл
		НоваяСтрокаТабличнойЧасти = Товары.Добавить();	
		ЗаполнитьЗначенияСвойств(НоваяСтрокаТабличнойЧасти, СтрокаТабличнойЧасти);
		
		ПараметрыНоменклатуры = Справочники.Номенклатура.ПолучитьПараметрыНоменклатуры(СтрокаТабличнойЧасти.Номенклатура);
		ЗаполнитьЗначенияСвойств(НоваяСтрокаТабличнойЧасти, ПараметрыНоменклатуры);
		
		НоваяСтрокаТабличнойЧасти.КоличествоМест = НоваяСтрокаТабличнойЧасти.Количество;
		
		НоваяСтрокаТабличнойЧасти.МассаГрузаНетто = НоваяСтрокаТабличнойЧасти.Количество * НоваяСтрокаТабличнойЧасти.ВесЕдиницыНоменклатуры;
		НоваяСтрокаТабличнойЧасти.МассаГрузаБрутто = НоваяСтрокаТабличнойЧасти.МассаГрузаНетто + НоваяСтрокаТабличнойЧасти.КоличествоМест * НоваяСтрокаТабличнойЧасти.ВесУпаковки;
		
		НоваяСтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Всего;  
		
		Если СтрокаТабличнойЧасти.СуммаСкидки > 0 Тогда
			НоваяСтрокаТабличнойЧасти.Сумма	= СтрокаТабличнойЧасти.Всего - СтрокаТабличнойЧасти.СуммаСкидки; 
			НоваяСтрокаТабличнойЧасти.Цена 	= НоваяСтрокаТабличнойЧасти.Сумма / НоваяСтрокаТабличнойЧасти.Количество;	
		КонецЕсли;
		
		НоваяСтрокаТабличнойЧасти.КлючСвязи = КлючСвязи;
		КлючСвязи = КлючСвязи + 1;
	КонецЦикла;
	
КонецПроцедуры

// Процедура заполнения документа на основании.
//
// Параметры:
//	ДанныеЗаполнения - ДокументСсылка.ВозвратТоваровПоставщику - Данные заполнения документа.
//	
Процедура ЗаполнитьПоВозвратТоваровПоставщику(ДанныеЗаполнения) Экспорт
	
	ДокументОснование = ДанныеЗаполнения;
	
	Организация = ДанныеЗаполнения.Организация;
	Контрагент = ДанныеЗаполнения.Контрагент;
	
	ЗаполнитьДанныеГрузополучателя();
	
	Если БухгалтерскийУчетВызовСервераПовтИсп.ВедетсяУчетЭСФ() Тогда 
		СведенияОбЭСФ = ЭСФСервер.СведенияОбЭСФПоДокументуОснованию(Организация, ДокументОснование);
		
		Если ТипЗнч(СведенияОбЭСФ.ПредставлениеЭСФ) = Тип("ДокументСсылка.ЭлектронныйСчетФактураВыписанный") Тогда
			НомерЭСФ = СведенияОбЭСФ.ПредставлениеЭСФ.НомерЭСФ;
		КонецЕсли;	
	КонецЕсли;
	
	Товары.Очистить(); 
	
	КлючСвязи = 1;
	
	Для Каждого СтрокаТабличнойЧасти Из ДанныеЗаполнения.Товары Цикл
		НоваяСтрокаТабличнойЧасти = Товары.Добавить();	
		ЗаполнитьЗначенияСвойств(НоваяСтрокаТабличнойЧасти, СтрокаТабличнойЧасти);
		
		ПараметрыНоменклатуры = Справочники.Номенклатура.ПолучитьПараметрыНоменклатуры(СтрокаТабличнойЧасти.Номенклатура);
		ЗаполнитьЗначенияСвойств(НоваяСтрокаТабличнойЧасти, ПараметрыНоменклатуры);
		
		НоваяСтрокаТабличнойЧасти.КоличествоМест = НоваяСтрокаТабличнойЧасти.Количество;
		
		НоваяСтрокаТабличнойЧасти.МассаГрузаНетто = НоваяСтрокаТабличнойЧасти.Количество * НоваяСтрокаТабличнойЧасти.ВесЕдиницыНоменклатуры;
		НоваяСтрокаТабличнойЧасти.МассаГрузаБрутто = НоваяСтрокаТабличнойЧасти.МассаГрузаНетто + НоваяСтрокаТабличнойЧасти.КоличествоМест * НоваяСтрокаТабличнойЧасти.ВесУпаковки;
		
		НоваяСтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Всего;   
		
		НоваяСтрокаТабличнойЧасти.КлючСвязи = КлючСвязи;
		КлючСвязи = КлючСвязи + 1;
	КонецЦикла;
	
КонецПроцедуры

// Процедура заполнения документа на основании.
//
// Параметры:
//	ДанныеЗаполнения - ДокументСсылка.ВозвратТоваровОтПокупателя - Данные заполнения документа.
//	
Процедура ЗаполнитьПоВозвратуТоваровОтПокупателя(ДанныеЗаполнения) Экспорт
	
	ДокументОснование = ДанныеЗаполнения;
	
	Организация = ДанныеЗаполнения.Организация;
	Контрагент = ДанныеЗаполнения.Контрагент;
	
	ЗаполнитьДанныеГрузополучателя();
	
	Если БухгалтерскийУчетВызовСервераПовтИсп.ВедетсяУчетЭСФ() Тогда 
		СведенияОбЭСФ = ЭСФСервер.СведенияОбЭСФПоДокументуОснованию(Организация, ДокументОснование);
		
		Если ТипЗнч(СведенияОбЭСФ.ПредставлениеЭСФ) = Тип("ДокументСсылка.ЭлектронныйСчетФактураВыписанный") Тогда
			НомерЭСФ = СведенияОбЭСФ.ПредставлениеЭСФ.НомерЭСФ;
		КонецЕсли;	
	КонецЕсли;
	
	Товары.Очистить(); 
	
	КлючСвязи = 1;
	
	Для Каждого СтрокаТабличнойЧасти Из ДанныеЗаполнения.Товары Цикл
		НоваяСтрокаТабличнойЧасти = Товары.Добавить();	
		ЗаполнитьЗначенияСвойств(НоваяСтрокаТабличнойЧасти, СтрокаТабличнойЧасти);
		
		ПараметрыНоменклатуры = Справочники.Номенклатура.ПолучитьПараметрыНоменклатуры(СтрокаТабличнойЧасти.Номенклатура);
		ЗаполнитьЗначенияСвойств(НоваяСтрокаТабличнойЧасти, ПараметрыНоменклатуры);
		
		НоваяСтрокаТабличнойЧасти.КоличествоМест = НоваяСтрокаТабличнойЧасти.Количество;
		
		НоваяСтрокаТабличнойЧасти.МассаГрузаНетто = НоваяСтрокаТабличнойЧасти.Количество * НоваяСтрокаТабличнойЧасти.ВесЕдиницыНоменклатуры;
		НоваяСтрокаТабличнойЧасти.МассаГрузаБрутто = НоваяСтрокаТабличнойЧасти.МассаГрузаНетто + НоваяСтрокаТабличнойЧасти.КоличествоМест * НоваяСтрокаТабличнойЧасти.ВесУпаковки;
		
		НоваяСтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Всего; 
		
		НоваяСтрокаТабличнойЧасти.КлючСвязи = КлючСвязи;
		КлючСвязи = КлючСвязи + 1;
	КонецЦикла;
	
КонецПроцедуры

// Процедура заполнения документа на основании.
//
// Параметры:
//	ДанныеЗаполнения - ДокументСсылка.ПеремещениеТоваров - Данные заполнения документа.
//	
Процедура ЗаполнитьПоПеремещениюТоваров(ДанныеЗаполнения) Экспорт
	
	ДокументОснование = ДанныеЗаполнения;
	
	Организация = ДанныеЗаполнения.Организация;
	Склад = ДанныеЗаполнения.СкладОтправитель;
	СкладПолучатель = ДанныеЗаполнения.СкладПолучатель;
	
	Товары.Очистить();   
	
	КлючСвязи = 1;
	
	Для Каждого СтрокаТабличнойЧасти Из ДанныеЗаполнения.Товары Цикл
		НоваяСтрокаТабличнойЧасти = Товары.Добавить();	
		ЗаполнитьЗначенияСвойств(НоваяСтрокаТабличнойЧасти, СтрокаТабличнойЧасти);
		
		ПараметрыНоменклатуры = Справочники.Номенклатура.ПолучитьПараметрыНоменклатуры(СтрокаТабличнойЧасти.Номенклатура);
		ЗаполнитьЗначенияСвойств(НоваяСтрокаТабличнойЧасти, ПараметрыНоменклатуры);
		
		НоваяСтрокаТабличнойЧасти.КоличествоМест = НоваяСтрокаТабличнойЧасти.Количество;
		
		НоваяСтрокаТабличнойЧасти.МассаГрузаНетто = НоваяСтрокаТабличнойЧасти.Количество * НоваяСтрокаТабличнойЧасти.ВесЕдиницыНоменклатуры;
		НоваяСтрокаТабличнойЧасти.МассаГрузаБрутто = НоваяСтрокаТабличнойЧасти.МассаГрузаНетто + НоваяСтрокаТабличнойЧасти.КоличествоМест * НоваяСтрокаТабличнойЧасти.ВесУпаковки;
		
		НоваяСтрокаТабличнойЧасти.КлючСвязи = КлючСвязи;
		КлючСвязи = КлючСвязи + 1;	
	КонецЦикла;
	
КонецПроцедуры

// Процедура заполнения документа на основании.
//
// Параметры:
//	ДанныеЗаполнения - ДокументСсылка.СписаниеТоваров - Данные заполнения документа.
//	
Процедура ЗаполнитьПоСписаниюТоваров(ДанныеЗаполнения) Экспорт
	
	ДокументОснование = ДанныеЗаполнения;
	
	Организация = ДанныеЗаполнения.Организация;
	Склад = ДанныеЗаполнения.Склад;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ХозрасчетныйОбороты.Счет КАК СчетУчета,
		|	ХозрасчетныйОбороты.Субконто1 КАК Номенклатура,
		|	-ХозрасчетныйОбороты.СуммаОборот КАК Сумма
		|ИЗ
		|	РегистрБухгалтерии.Хозрасчетный.Обороты(
		|			&Период,
		|			&Период,
		|			Регистратор,
		|			Счет В (&СчетаУчета),
		|			ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыСубконтоХозрасчетные.Номенклатура),
		|			Организация = &Организация
		|				И Субконто1 В (&СписокНоменклатуры),
		|			КорСчет В (&СчетаЗатрат),
		|			) КАК ХозрасчетныйОбороты";
	Запрос.УстановитьПараметр("Организация", 		Организация);
	Запрос.УстановитьПараметр("Период", 			ДанныеЗаполнения.Дата);     
	Запрос.УстановитьПараметр("СписокНоменклатуры",	ДанныеЗаполнения.Товары.ВыгрузитьКолонку("Номенклатура"));
	Запрос.УстановитьПараметр("СчетаЗатрат", 		ДанныеЗаполнения.Товары.ВыгрузитьКолонку("СчетЗатрат"));
	Запрос.УстановитьПараметр("СчетаУчета", 		ДанныеЗаполнения.Товары.ВыгрузитьКолонку("СчетУчета"));
	
	ТаблицаСебестоимости = Запрос.Выполнить().Выгрузить();	
	
	Отбор = Новый Структура();
	Отбор.Вставить("Номенклатура", 	Неопределено);
	Отбор.Вставить("СчетУчета", 	Неопределено);
	
	Товары.Очистить();
	
	КлючСвязи = 1;
	
	Для Каждого СтрокаТабличнойЧасти Из ДанныеЗаполнения.Товары Цикл
		НоваяСтрокаТабличнойЧасти = Товары.Добавить();	
		ЗаполнитьЗначенияСвойств(НоваяСтрокаТабличнойЧасти, СтрокаТабличнойЧасти);
		
		ПараметрыНоменклатуры = Справочники.Номенклатура.ПолучитьПараметрыНоменклатуры(СтрокаТабличнойЧасти.Номенклатура);
		ЗаполнитьЗначенияСвойств(НоваяСтрокаТабличнойЧасти, ПараметрыНоменклатуры);
		
		НоваяСтрокаТабличнойЧасти.КоличествоМест = НоваяСтрокаТабличнойЧасти.Количество;
		
		НоваяСтрокаТабличнойЧасти.МассаГрузаНетто = НоваяСтрокаТабличнойЧасти.Количество * НоваяСтрокаТабличнойЧасти.ВесЕдиницыНоменклатуры;
		НоваяСтрокаТабличнойЧасти.МассаГрузаБрутто = НоваяСтрокаТабличнойЧасти.МассаГрузаНетто + НоваяСтрокаТабличнойЧасти.КоличествоМест * НоваяСтрокаТабличнойЧасти.ВесУпаковки;
		
		ЗаполнитьЗначенияСвойств(Отбор, СтрокаТабличнойЧасти);
		
		НайденныеДанные = ТаблицаСебестоимости.НайтиСтроки(Отбор);
		
		Если НайденныеДанные.Количество() > 0 Тогда
			НоваяСтрокаТабличнойЧасти.Сумма = НайденныеДанные[0].Сумма;
			НоваяСтрокаТабличнойЧасти.Цена	= НоваяСтрокаТабличнойЧасти.Сумма / НоваяСтрокаТабличнойЧасти.Количество;
		КонецЕсли;  
		
		НоваяСтрокаТабличнойЧасти.КлючСвязи = КлючСвязи;
		КлючСвязи = КлючСвязи + 1;
	КонецЦикла;
	
КонецПроцедуры

// Процедура заполнения документа на основании.
//
// Параметры:
//	ДанныеЗаполнения - ДокументСсылка.ОприходованиеТоваров - Данные заполнения документа.
//	
Процедура ЗаполнитьПоОприходованиюТоваров(ДанныеЗаполнения) Экспорт
	
	ДокументОснование = ДанныеЗаполнения;
	
	Организация = ДанныеЗаполнения.Организация;
	Склад = ДанныеЗаполнения.Склад;
	
	Товары.Очистить();
	
	КлючСвязи = 1;
	
	Для Каждого СтрокаТабличнойЧасти Из ДанныеЗаполнения.Товары Цикл
		НоваяСтрокаТабличнойЧасти = Товары.Добавить();	
		ЗаполнитьЗначенияСвойств(НоваяСтрокаТабличнойЧасти, СтрокаТабличнойЧасти);
		
		ПараметрыНоменклатуры = Справочники.Номенклатура.ПолучитьПараметрыНоменклатуры(СтрокаТабличнойЧасти.Номенклатура);
		ЗаполнитьЗначенияСвойств(НоваяСтрокаТабличнойЧасти, ПараметрыНоменклатуры);
		
		НоваяСтрокаТабличнойЧасти.КоличествоМест = НоваяСтрокаТабличнойЧасти.Количество;
		
		НоваяСтрокаТабличнойЧасти.МассаГрузаНетто = НоваяСтрокаТабличнойЧасти.Количество * НоваяСтрокаТабличнойЧасти.ВесЕдиницыНоменклатуры;
		НоваяСтрокаТабличнойЧасти.МассаГрузаБрутто = НоваяСтрокаТабличнойЧасти.МассаГрузаНетто + НоваяСтрокаТабличнойЧасти.КоличествоМест * НоваяСтрокаТабличнойЧасти.ВесУпаковки;
		
		НоваяСтрокаТабличнойЧасти.КлючСвязи = КлючСвязи;
		КлючСвязи = КлючСвязи + 1;	
	КонецЦикла;
	
КонецПроцедуры
 
// Процедура заполнения документа на основании.
//
// Параметры:
//	ДанныеЗаполнения - ДокументСсылка.ПоступлениеТоваровУслуг - Данные заполнения документа.
//	
Процедура ЗаполнитьПоПоступлениюТоваровУслуг(ДанныеЗаполнения) Экспорт
	
	ДокументОснование = ДанныеЗаполнения;
	
	Организация = ДанныеЗаполнения.Организация;
	Склад = ДанныеЗаполнения.Склад;
	
	КлючСвязи = 1;
	
	ВалютаРегламентированногоУчета = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьВалютуРегламентированногоУчета();
	
	Для Каждого СтрокаТабличнойЧасти Из ДанныеЗаполнения.Товары Цикл
		НоваяСтрокаТабличнойЧасти = Товары.Добавить();	
		ЗаполнитьЗначенияСвойств(НоваяСтрокаТабличнойЧасти, СтрокаТабличнойЧасти);
		
		Если НЕ ВалютаРегламентированногоУчета = ДанныеЗаполнения.Курс Тогда
			НоваяСтрокаТабличнойЧасти.Цена = НоваяСтрокаТабличнойЧасти.Цена * ДанныеЗаполнения.Курс;	
		КонецЕсли;	
		
		НоваяСтрокаТабличнойЧасти.КлючСвязи = КлючСвязи;
		КлючСвязи = КлючСвязи + 1;	
	КонецЦикла;	
КонецПроцедуры
  
// Процедура заполнения документа на основании.
//
// Параметры:
//	ДанныеЗаполнения - ДокументСсылка.ОтчетПроизводстваЗаСмену - Данные заполнения документа.
//	
Процедура ЗаполнитьПоОтчетуПроизводстваЗаСмену(ДанныеЗаполнения) Экспорт
	
	ДокументОснование = ДанныеЗаполнения;
	
	Организация = ДанныеЗаполнения.Организация;
	Склад = ДанныеЗаполнения.СкладПродукция;
	
	КлючСвязи = 1;
	
	Для Каждого СтрокаТабличнойЧасти Из ДанныеЗаполнения.Продукция Цикл
		НоваяСтрокаТабличнойЧасти = Товары.Добавить();	
		ЗаполнитьЗначенияСвойств(НоваяСтрокаТабличнойЧасти, СтрокаТабличнойЧасти);
		
		НоваяСтрокаТабличнойЧасти.Цена 	= СтрокаТабличнойЧасти.ПлановаяСтоимость;
		НоваяСтрокаТабличнойЧасти.Сумма	= СтрокаТабличнойЧасти.СуммаПлановая;
		
		НоваяСтрокаТабличнойЧасти.КлючСвязи = КлючСвязи;
		КлючСвязи = КлючСвязи + 1;	
	КонецЦикла;	
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытий

// Процедура - обработчик события ОбработкаЗаполнения объекта.
//
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	СтратегияЗаполнения = Новый Соответствие;
	СтратегияЗаполнения[Тип("ДокументСсылка.РеализацияТоваровУслуг")] = "ЗаполнитьПоРеализацииТоваровУслуг";
	СтратегияЗаполнения[Тип("ДокументСсылка.ВозвратТоваровПоставщику")] = "ЗаполнитьПоВозвратТоваровПоставщику";
	СтратегияЗаполнения[Тип("ДокументСсылка.ВозвратТоваровОтПокупателя")] = "ЗаполнитьПоВозвратуТоваровОтПокупателя";
	СтратегияЗаполнения[Тип("ДокументСсылка.ПеремещениеТоваров")] = "ЗаполнитьПоПеремещениюТоваров";
	СтратегияЗаполнения[Тип("ДокументСсылка.СписаниеТоваров")] = "ЗаполнитьПоСписаниюТоваров";
	СтратегияЗаполнения[Тип("ДокументСсылка.ОприходованиеТоваров")] = "ЗаполнитьПоОприходованиюТоваров";
	СтратегияЗаполнения[Тип("ДокументСсылка.ПоступлениеТоваровУслуг")] = "ЗаполнитьПоПоступлениюТоваровУслуг";
	СтратегияЗаполнения[Тип("ДокументСсылка.ОтчетПроизводстваЗаСмену")] = "ЗаполнитьПоОтчетуПроизводстваЗаСмену";
	
	ЗаполнениеОбъектовБП.ЗаполнитьДокумент(ЭтотОбъект, ДанныеЗаполнения, СтратегияЗаполнения);
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		ВидОперации = Перечисления.ВидыОперацийТТН.Реализация;	
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ВозвратТоваровОтПокупателя") Тогда
		ВидОперации = Перечисления.ВидыОперацийТТН.Возврат;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
		ВидОперации = Перечисления.ВидыОперацийТТН.Перемещение;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.СписаниеТоваров") Тогда
		ВидОперации = Перечисления.ВидыОперацийТТН.Списание;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ОприходованиеТоваров")
		ИЛИ ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг")
		ИЛИ ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ОтчетПроизводстваЗаСмену") Тогда
		ВидОперации = Перечисления.ВидыОперацийТТН.Оприходование;	
	КонецЕсли;	
КонецПроцедуры

// Процедура - обработчик события ОбработкаПроверкиЗаполнения объекта.
//
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	ПроверяемыеРеквизиты.Добавить("Товары");
	
	Если ВидОперации = Перечисления.ВидыОперацийТТН.Перемещение
		ИЛИ ВидОперации = Перечисления.ВидыОперацийТТН.Списание
		ИЛИ ВидОперации = Перечисления.ВидыОперацийТТН.Оприходование
		ИЛИ ВидОперации = Перечисления.ВидыОперацийТТН.ВыгрузкаОстатков Тогда
		БухгалтерскийУчетСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "Контрагент");	
	КонецЕсли;
	
	Если ВидОперации = Перечисления.ВидыОперацийТТН.ВыгрузкаОстатков Тогда
		БухгалтерскийУчетСервер.УдалитьПроверяемыйРеквизит(ПроверяемыеРеквизиты, "ДокументОснование");	
	КонецЕсли;
КонецПроцедуры // ОбработкаПроверкиЗаполнения()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьДанныеГрузополучателя()

	Если ЗначениеЗаполнено(Контрагент) Тогда
		СведенияОКонтрагенте = БухгалтерскийУчетСервер.ПолучитьСведенияОКонтрагенте(Контрагент);
		АдресКонтрагента = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Контрагент, 
								Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента); 
		ТелефонКонтрагента = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(Контрагент, 
									Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента); 
		
		Грузополучатель = "" + СведенияОКонтрагенте.НаименованиеПолное 
								+ ?(ЗначениеЗаполнено(СведенияОКонтрагенте.ИНН),", " + СведенияОКонтрагенте.ИНН, "") 
								+ ?(ЗначениеЗаполнено(АдресКонтрагента),", " + АдресКонтрагента, "")
								+ ", " + ТелефонКонтрагента;		
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
